Repository: crinis/mindfula11y
Catalog: Resources/Private/Language/Modules/*.Accessibility.xlf
Languages: de

# mlang_labels_tablabel
source: Accessibility
de: Barrierefreiheit

# mlang_tabs_tab
source: Accessibility
de: Barrierefreiheit

# module.noPageSelected
source: No page selected.
de: Keine Seite ausgewählt.

# module.noPageSelected.description
source: Please select a page in the page tree to check for accessibility issues.
de: Bitte wählen Sie eine Seite im Seitenbaum aus, um sie auf Barrierefreiheitsprobleme zu prüfen.

# module.noLanguageAccess
source: Page not available in your allowed languages.
de: Seite nicht in Ihren erlaubten Sprachen verfügbar.

# module.noLanguageAccess.description
source: This page is not translated to any of the languages you have access to. Please select a different page that is available in one of your allowed languages.
de: Diese Seite ist in keine der Sprachen übersetzt, auf die Sie Zugriff haben. Bitte wählen Sie eine andere Seite, die in einer Ihrer erlaubten Sprachen verfügbar ist.

# module.error.invalidSignature
source: Invalid request signature
de: Ungültige Anfrage-Signatur

# module.error.invalidSignature.description
source: The request signature is invalid. Please refresh the page and try again.
de: Die Anfrage-Signatur ist ungültig. Bitte laden Sie die Seite neu und versuchen Sie es erneut.

# module.menu.language
source: Language
de: Sprache

source: Structure errors
de: Strukturfehler

source: Structure
de: Struktur

# general.viewDetails
source: View Details
de: Details anzeigen

# module.menu.pageLevels
source: Check Recursive
de: Rekursiv prüfen

# module.menu.pageLevels.1
source: Levels 1
de: Ebene 1

# module.menu.pageLevels.5
source: Levels 5
de: 5 Ebenen

# module.menu.pageLevels.10
source: Levels 10
de: 10 Ebenen

# module.menu.pageLevels.99
source: Levels 99
de: 99 Ebenen

# module.menu.tables
source: Record Type
de: Datensatztyp

# module.menu.tables.all
source: All Record Types
de: Alle Datensatztypen

# module.menu.filter.fileMetaData
source: Filter records with inherited alternative text
de: Datensätze mit geerbtem Alternativtext ausblenden

# module.menu.features
source: Feature
de: Funktion

# module.menu.features.general
source: General
de: Allgemein

# module.menu.features.missingAltText
source: Missing alternative text
de: Fehlender Alternativtext

# severity.error
source: Error
de: Fehler

# severity.warning
source: Warning
de: Warnung

# severity.critical
source: Critical
de: Kritisch

# severity.serious
source: Serious
de: Schwerwiegend

# severity.moderate
source: Moderate
de: Mäßig

# severity.minor
source: Minor
de: Geringfügig

# general.error.loading
source: Failed to load heading/landmark structure.
de: Überschriften-/Landmark-Struktur konnte nicht geladen werden.

# general.error.loading.description
source: Could not analyze the page content. Please try again or check your connection.
de: Der Seiteninhalt konnte nicht analysiert werden. Bitte versuchen Sie es erneut oder überprüfen Sie Ihre Verbindung.

# altText
source: File references without alternative text
de: Dateiverweise ohne Alternativtext

# altText.generate.button
source: Generate
de: Generieren

# altText.generate.loading
source: Generating alternative text...
de: Alternativtext wird generiert...

# altText.generate.success
source: Alternative text generated.
de: Alternativtext generiert.

# altText.generate.success.description
source: Alternative text was successfully generated. Please make sure it describes the picture accurately.
de: Der Alternativtext wurde erfolgreich generiert. Bitte stellen Sie sicher, dass er das Bild treffend beschreibt.

# altText.generate.error.unknown
source: Unknown error occurred.
de: Unbekannter Fehler aufgetreten.

# altText.generate.error.unknown.description
source: An unknown error occurred. Please contact your admin or try again later.
de: Es ist ein unbekannter Fehler aufgetreten. Bitte wenden Sie sich an Ihren Administrator oder versuchen Sie es später erneut.

# altText.generate.error.openAIConnection
source: ChatGPT connection error.
de: ChatGPT-Verbindungsfehler.

# altText.generate.error.openAIConnection.description
source: Could not establish connection to ChatGPT. Is your API-Key OK?
de: Verbindung zu ChatGPT konnte nicht hergestellt werden. Ist Ihr API-Schlüssel korrekt?

# altText.editRecord.label
source: Edit record [%1$s][%2$s].
de: Datensatz bearbeiten [%1$s][%2$s].

# altText.altLabel
source: Alternative text
de: Alternativtext

# altText.altPlaceholder
source: Enter alternative text for the image
de: Alternativtext für das Bild eingeben

# altText.save
source: Save
de: Speichern

# altText.imagePreview
source: Image preview
de: Bildvorschau

# altText.fallbackAltLabel
source: Label specified in file metadata:
de: In den Dateimetadaten festgelegter Alternativtext:

# altText.pagination.navigation
source: Pagination navigation
de: Seitennavigation

# altText.pagination.previous
source: Previous page
de: Vorherige Seite

# altText.pagination.next
source: Next page
de: Nächste Seite

# altText.pagination.page
source: Go to page %1$s
de: Zu Seite %1$s

# altText.noMissingAltText
source: No file references without alternative text found.
de: Keine Dateiverweise ohne Alternativtext gefunden.

# altText.count
source: %1$d file references without alternative text found.
de: %1$d Dateiverweise ohne Alternativtext gefunden.

# altText.noAccess
source: No access to missing alternative text feature.
de: Kein Zugriff auf die Funktion „Fehlender Alternativtext".

# altText.noAccess.description
source: You do not have permission to access file references. Please contact your administrator.
de: Sie haben keine Berechtigung, auf Dateiverweise zuzugreifen. Bitte wenden Sie sich an Ihren Administrator.

# altText.noTableAccess
source: No access to the selected table.
de: Kein Zugriff auf die gewählte Tabelle.

# altText.noTableAccess.description
source: Please select a record type that you have access to or contact your administrator.
de: Bitte wählen Sie einen Datensatztyp, auf den Sie Zugriff haben, oder wenden Sie sich an Ihren Administrator.

# structure.headings
source: Headings
de: Überschriften

# structure.headings.error.store
source: Saving heading type failed.
de: Überschriftentyp konnte nicht gespeichert werden.

# structure.headings.error.store.description
source: Could not save the heading type. Do you have permission?
de: Der Überschriftentyp konnte nicht gespeichert werden. Haben Sie die erforderlichen Berechtigungen?

# structure.headings.error.emptyHeadings
source: Empty headings found.
de: Leere Überschriften gefunden.

# structure.headings.error.emptyHeadings.description
source: Headings without text content provide no semantic value and can confuse screen reader users. Please add descriptive text to all heading elements or remove empty headings.
de: Überschriften ohne Textinhalt bieten keinen semantischen Mehrwert und können Screenreader-Nutzer verwirren. Bitte fügen Sie allen Überschriftenelementen beschreibenden Text hinzu oder entfernen Sie leere Überschriften.

# structure.headings.error.skippedLevel
source: Skipped heading levels!
de: Überschriftenebenen übersprungen!

# structure.headings.error.skippedLevel.description
source: Heading levels should not be skipped. For example, an <h2> should not be followed directly by an <h4> without an intervening <h3>. Proper heading structure helps screen reader users understand the content hierarchy.
de: Überschriftenebenen sollten nicht übersprungen werden. Auf eine <h2> sollte beispielsweise nicht direkt eine <h4> folgen, ohne eine dazwischenliegende <h3>. Eine korrekte Überschriftenstruktur hilft Screenreader-Nutzern, die inhaltliche Hierarchie zu verstehen.

# structure.headings.error.skippedLevel.inline
source: Skipped H%1$d
de: H%1$d übersprungen

# structure.headings.error.missingH1
source: Missing <h1> heading.
de: Fehlende <h1>-Überschrift.

# structure.headings.error.missingH1.description
source: Every page should have exactly one <h1> as the main heading, usually at the top of the main content. Screenreader users rely on the <h1> to quickly skip to the main content and get to understand what the content is about.
de: Jede Seite sollte genau eine <h1>-Überschrift als Hauptüberschrift haben, in der Regel am Anfang des Hauptinhalts. Screenreader-Nutzer verlassen sich auf die <h1>, um schnell zum Hauptinhalt zu gelangen und dessen Thema zu erfassen.

# structure.headings.error.multipleH1
source: Multiple <h1> headings found.
de: Mehrere <h1>-Überschriften gefunden.

# structure.headings.error.multipleH1.description
source: Pages should have exactly one <h1> heading to provide a clear document structure. Multiple <h1> elements can confuse screen readers and hurt SEO. Consider using <h2> or other heading levels for additional headings.
de: Seiten sollten genau eine <h1>-Überschrift haben, um eine klare Dokumentstruktur zu gewährleisten. Mehrere <h1>-Elemente können Screenreader verwirren und sich negativ auf SEO auswirken. Verwenden Sie <h2> oder andere Überschriftenebenen für weitere Überschriften.

# structure.headings.edit
source: Edit heading
de: Überschrift bearbeiten

# structure.headings.edit.locked
source: Heading is not editable
de: Überschrift ist nicht bearbeitbar

# structure.headings.unlabeled
source: Unlabeled heading
de: Unbetitelte Überschrift

# structure.headings.type
source: Heading type
de: Überschriftentyp

# structure.headings.relation.descendant
source: Related to parent heading
de: Untergeordnet zur übergeordneten Überschrift

# structure.headings.relation.sibling
source: Related to sibling heading
de: Gleichrangig zur benachbarten Überschrift

# structure.headings.relation.notFound
source: Ancestor not found
de: Übergeordnete Überschrift nicht gefunden

# structure.headings.relation.notFound.description
source: The referenced ancestor heading could not be found in the document.
de: Die referenzierte übergeordnete Überschrift konnte im Dokument nicht gefunden werden.

# structure.headings.noHeadings
source: No headings found
de: Keine Überschriften gefunden

# structure.headings.noHeadings.description
source: No heading elements (h1-h6) were found on this page.
de: Auf dieser Seite wurden keine Überschriftenelemente (h1–h6) gefunden.

# structure.landmarks.edit
source: Edit landmark
de: Landmark bearbeiten

# structure.landmarks.edit.locked
source: Landmark is not editable
de: Landmark ist nicht bearbeitbar

# structure.landmarks.nested
source: Nested landmarks
de: Verschachtelte Landmarks

# structure.landmarks.role
source: Landmark role
de: Landmark-Rolle

# structure.landmarks.error.roleSelect
source: Select a valid landmark role.
de: Bitte wählen Sie eine gültige Landmark-Rolle.

# structure.landmarks.role.none
source: No Landmark (none)
de: Kein Landmark (none)

# structure.landmarks.role.banner
source: Site Header (banner)
de: Seitenkopf (banner)

# structure.landmarks.role.main
source: Main Content (main)
de: Hauptinhalt (main)

# structure.landmarks.role.complementary
source: Sidebar (complementary)
de: Seitenleiste (complementary)

# structure.landmarks.role.contentinfo
source: Site Footer (contentinfo)
de: Seitenfuß (contentinfo)

# structure.landmarks.role.region
source: Section (region)
de: Abschnitt (region)

# structure.landmarks.role.search
source: Search (search)
de: Suche (search)

# structure.landmarks.role.form
source: Form (form)
de: Formular (form)

# structure.landmarks.noLandmarks
source: No landmarks found
de: Keine Landmarks gefunden

# structure.landmarks.noLandmarks.description
source: This page doesn't contain any ARIA landmarks or semantic HTML elements.
de: Diese Seite enthält keine ARIA-Landmarks oder semantischen HTML-Elemente.

# structure.landmarks.error.store
source: Saving landmark role failed.
de: Landmark-Rolle konnte nicht gespeichert werden.

# structure.landmarks.error.store.description
source: Could not save the landmark role. Do you have permission?
de: Die Landmark-Rolle konnte nicht gespeichert werden. Haben Sie die erforderlichen Berechtigungen?

# structure.landmarks.error.missingMain
source: Missing main landmark.
de: Fehlendes main-Landmark.

# structure.landmarks.error.missingMain.description
source: Every page should have exactly one main landmark to identify the main content area. This helps screenreader users quickly navigate to the primary content.
de: Jede Seite sollte genau ein main-Landmark haben, um den Hauptinhaltsbereich zu kennzeichnen. Dies hilft Screenreader-Nutzern, schnell zum primären Inhalt zu navigieren.

# structure.landmarks.error.duplicateMain
source: Multiple main landmarks found.
de: Mehrere main-Landmarks gefunden.

# structure.landmarks.error.duplicateMain.description
source: Only one main landmark is allowed per page. Multiple main landmarks can confuse screen reader users.
de: Pro Seite ist nur ein main-Landmark erlaubt. Mehrere main-Landmarks können Screenreader-Nutzer verwirren.

# structure.landmarks.error.duplicateSameLabel
source: Landmarks with identical labels.
de: Landmarks mit identischen Bezeichnungen.

# structure.landmarks.error.duplicateSameLabel.description
source: Multiple landmarks share an identical label. Provide unique labels so users can differentiate them.
de: Mehrere Landmarks haben identische Bezeichnungen. Vergeben Sie eindeutige Bezeichnungen, damit Nutzer sie unterscheiden können.

# structure.landmarks.error.multipleUnlabeledLandmarks
source: Multiple unlabeled landmarks of the same role.
de: Mehrere unbetitelte Landmarks derselben Rolle.

# structure.landmarks.error.multipleUnlabeledLandmarks.description
source: More than one landmark with the same role lacks a label. Add unique labels (aria-label or aria-labelledby) so users can distinguish them.
de: Mehr als ein Landmark derselben Rolle hat keine Bezeichnung. Fügen Sie eindeutige Bezeichnungen (aria-label oder aria-labelledby) hinzu, damit Nutzer sie unterscheiden können.

# structure.landmarks.unlabelledLandmark
source: Unlabelled Landmark
de: Unbetiteltes Landmark

# error.forbidden
source: Access denied
de: Zugriff verweigert

# error.forbidden.description
source: You do not have permission to perform this action.
de: Sie haben keine Berechtigung, diese Aktion durchzuführen.

# error.invalidUser
source: Invalid user session
de: Ungültige Benutzersitzung

# error.invalidUser.description
source: Your user session is invalid. Please refresh the page and try again.
de: Ihre Benutzersitzung ist ungültig. Bitte laden Sie die Seite neu und versuchen Sie es erneut.

# error.invalidWorkspace
source: Invalid workspace context
de: Ungültiger Workspace-Kontext

# error.invalidWorkspace.description
source: The workspace context is invalid. Please switch to the correct workspace and try again.
de: Der Workspace-Kontext ist ungültig. Bitte wechseln Sie in den richtigen Workspace und versuchen Sie es erneut.

# error.invalidLanguage
source: Invalid language access
de: Kein Zugriff auf diese Sprache

# error.invalidLanguage.description
source: You do not have access to the selected language. Please select an allowed language.
de: Sie haben keinen Zugriff auf die gewählte Sprache. Bitte wählen Sie eine erlaubte Sprache.

# error.invalidRecordAccess
source: Invalid record access
de: Kein Zugriff auf den Datensatz

# error.invalidRecordAccess.description
source: You do not have permission to edit this record or its specified fields.
de: Sie haben keine Berechtigung, diesen Datensatz oder die angegebenen Felder zu bearbeiten.

# error.noPageAccess
source: No page access
de: Kein Seitenzugriff

# error.noPageAccess.description
source: You do not have access to this page. Please contact your administrator.
de: Sie haben keinen Zugriff auf diese Seite. Bitte wenden Sie sich an Ihren Administrator.

# error.noFileAccess
source: No access to sys_file table
de: Kein Zugriff auf die Dateitabelle

# error.noFileAccess.description
source: You do not have permission to read sys_file records. Please contact your administrator.
de: Sie haben keine Berechtigung, Dateidatensätze zu lesen. Bitte wenden Sie sich an Ihren Administrator.

# error.noFileMountAccess
source: No file access
de: Kein Dateizugriff

# error.noFileMountAccess.description
source: You do not have permission to read this file. The file may be outside your file mount boundaries.
de: Sie haben keine Berechtigung, diese Datei zu lesen. Die Datei befindet sich möglicherweise außerhalb Ihrer Datei-Einhängepunkte.

# error.fileNotFound
source: File not found
de: Datei nicht gefunden

# error.fileNotFound.description
source: The file could not be found. It may have been deleted or moved since this form was opened.
de: Die Datei konnte nicht gefunden werden. Sie wurde möglicherweise gelöscht oder verschoben, seit dieses Formular geöffnet wurde.

# scan
source: Scan for accessibility issues
de: Auf Barrierefreiheitsprobleme scannen

# scan.noAccess
source: No scan access
de: Kein Scan-Zugriff

# scan.noAccess.description
source: You do not have access to the accessibility scanner. Please contact your administrator to enable scan access.
de: Sie haben keinen Zugriff auf den Accessibility-Scanner. Bitte wenden Sie sich an Ihren Administrator, um den Scan-Zugriff zu aktivieren.

# scan.previewNotEnabled
source: Preview not available for this page type
de: Vorschau für diesen Seitentyp nicht verfügbar

# scan.previewNotEnabled.description
source: The accessibility scanner requires a preview URL to scan the page. This page type does not support preview or preview is disabled.
de: Der Accessibility-Scanner benötigt eine Vorschau-URL, um die Seite zu scannen. Dieser Seitentyp unterstützt keine Vorschau oder die Vorschau ist deaktiviert.

# scan.notConfigured
source: Scanner not configured
de: Scanner nicht konfiguriert

# scan.notConfigured.description
source: The accessibility scanner API is not configured. Please contact your administrator to configure the API URL and token.
de: Die Accessibility-Scanner-API ist nicht konfiguriert. Bitte wenden Sie sich an Ihren Administrator, um die API-URL und den Token einzurichten.

# scan.start
source: Start Scan
de: Scan starten

# scan.refresh
source: Refresh Results
de: Ergebnisse aktualisieren

# scan.loading
source: Loading scan results...
de: Scan-Ergebnisse werden geladen...

# scan.status.pending
source: Scan Pending
de: Scan ausstehend

# scan.status.running
source: Scan Running
de: Scan läuft

# scan.status.failed
source: Scan Failed
de: Scan fehlgeschlagen

# scan.status.failed.description
source: The accessibility scan failed. Please try again later or contact your administrator.
de: Der Accessibility-Scan ist fehlgeschlagen. Bitte versuchen Sie es später erneut oder wenden Sie sich an Ihren Administrator.

# scan.error.notConfigured
source: Scanner API not configured
de: Scanner-API nicht konfiguriert

# scan.error.notConfigured.description
source: The accessibility scanner API URL and token are not configured.
de: Die URL und der Token der Accessibility-Scanner-API sind nicht konfiguriert.

# scan.error.createFailed
source: Failed to create scan
de: Scan konnte nicht erstellt werden

# scan.error.createFailed.description
source: Could not create a new accessibility scan. Please try again or contact your administrator.
de: Ein neuer Accessibility-Scan konnte nicht erstellt werden. Bitte versuchen Sie es erneut oder wenden Sie sich an Ihren Administrator.

# scan.error.noScanId
source: No scan ID found
de: Keine Scan-ID gefunden

# scan.error.noScanId.description
source: No scan ID was found for this page. Please start a new scan.
de: Für diese Seite wurde keine Scan-ID gefunden. Bitte starten Sie einen neuen Scan.

# scan.error.getFailed
source: Failed to load scan results
de: Scan-Ergebnisse konnten nicht geladen werden

# scan.error.getFailed.description
source: Could not load the accessibility scan results. Please try again.
de: Die Accessibility-Scan-Ergebnisse konnten nicht geladen werden. Bitte versuchen Sie es erneut.

# scan.error.storeFailed
source: Failed to store scan ID
de: Scan-ID konnte nicht gespeichert werden

# scan.error.storeFailed.description
source: Could not store the scan ID in the database. Please try again.
de: Die Scan-ID konnte nicht in der Datenbank gespeichert werden. Bitte versuchen Sie es erneut.

# scan.helpLinks
source: More information
de: Weitere Informationen

# scan.viewScreenshot
source: View Screenshot
de: Screenshot anzeigen

# scan.issueCount
source: %d Issue
de: %d Problem

# scan.issuesCount
source: %d Issues
de: %d Probleme

# scan.selector
source: Selector:
de: Selektor:

# scan.context
source: HTML Context:
de: HTML-Kontext:

# scan.processing
source: Processing...
de: Wird verarbeitet...

# scan.issuesFound
source: Last external scan: %d accessibility issues found
de: Letzter externer Scan: %d Barrierefreiheitsprobleme gefunden

# scan.noIssues
source: Last external scan: No accessibility issues found
de: Letzter externer Scan: Keine Barrierefreiheitsprobleme gefunden

# scan.error.loading
source: The last external scan failed.
de: Der letzte externe Scan ist fehlgeschlagen.

# scan.error.notFound
source: Scan result not found
de: Scan-Ergebnis nicht gefunden

# scan.error.notFound.description
source: The requested scan result could not be found.
de: Das angeforderte Scan-Ergebnis konnte nicht gefunden werden.

# scan.error.pageNotFound
source: Page not found
de: Seite nicht gefunden

# scan.error.pageNotFound.description
source: The requested page or translation does not exist.
de: Die angeforderte Seite oder Übersetzung existiert nicht.

# scan.error.pageVisible
source: Page not visible
de: Seite nicht sichtbar

# scan.error.pageVisible.description
source: The page is hidden or not yet published. The external accessibility scanner cannot access it.
de: Die Seite ist ausgeblendet oder noch nicht veröffentlicht. Der externe Accessibility-Scanner kann nicht auf sie zugreifen.

# scan.error.accessDenied
source: Access denied
de: Zugriff verweigert

# scan.error.accessDenied.description
source: You do not have access to view this scan result.
de: Sie haben keinen Zugriff auf dieses Scan-Ergebnis.

# command.cleanupScanIds.option.seconds
source: Number of seconds after which scan IDs should be considered old (default: 2592000 = 30 days)
de: Anzahl der Sekunden, nach denen Scan-IDs als veraltet gelten (Standard: 2592000 = 30 Tage)

# command.cleanupScanIds.processing
source: Finding scan IDs older than %d seconds (before %s)...
de: Suche nach Scan-IDs, die älter als %d Sekunden sind (vor %s)...

# command.cleanupScanIds.noOldScans
source: No old scan IDs found to clean up.
de: Keine veralteten Scan-IDs zum Bereinigen gefunden.

# command.cleanupScanIds.success
source: Successfully cleaned up %d old scan IDs.
de: %d veraltete Scan-IDs erfolgreich bereinigt.
