Repository: crinis/mindfula11y
Catalog: Resources/Private/Language/Modules/*.HeadingStructure.xlf
Languages: de

# mlang_labels_tablabel
source: Heading Structure
de: Überschriftenstruktur

# mlang_labels_tabdescr
source: Listing the heading structure of the currently selected page and providing options to fix it.
de: Auflistung der Überschriftenstruktur der aktuell ausgewählten Seite und Bereitstellung von Optionen zur Behebung von Problemen.

# mlang_tabs_tab
source: Heading Structure
de: Überschriftenstruktur

source: No headings found.
de: Keine Überschriften gefunden.

# error.loading
source: Loading heading structure failed.
de: Laden der Überschriftenstruktur fehlgeschlagen.

# error.loading.description
source: Could not load the heading structure. Cannot analyze the page heading structure.
de: Überschriftenstruktur konnte nicht geladen werden. Die Seitenüberschriftenstruktur kann nicht analysiert werden.

# error.store
source: Saving heading level failed.
de: Speichern der Überschriftenebene fehlgeschlagen.

# error.store.description
source: Could not save the heading level. Do you have permission?
de: Überschriftenebene konnte nicht gespeichert werden. Haben Sie die erforderlichen Berechtigungen?

# error.skippedLevel
source: Skipped heading levels!
de: Übersprungene Überschriftenebenen!

# error.skippedLevel.description
source: Headings should be nested in a logical order. For example, if you have an <h1>, the next heading should be an <h2>, not an <h3> or <h4>. This is important for screenreader users to understand the page structure.
de: Überschriften sollten in logischer Reihenfolge verschachtelt werden. Wenn Sie beispielsweise eine <h1> haben, sollte die nächste Überschrift eine <h2> sein, nicht eine <h3> oder <h4>. Dies ist wichtig für Screenreader-Nutzer, um die Seitenstruktur zu verstehen.

# error.missingH1
source: Missing <h1> heading.
de: Fehlende <h1>-Überschrift.

# error.missingH1.description
source: Every page should have exactly one <h1> as the main heading, usually at the top of the main content. Screenreader users rely on the <h1> to quickly skip to the main content and get to understand what the content is about.
de: Jede Seite sollte genau eine <h1> als Hauptüberschrift haben, normalerweise am Anfang des Hauptinhalts. Screenreader-Nutzer sind auf die <h1> angewiesen, um schnell zum Hauptinhalt zu springen und zu verstehen, worum es in dem Inhalt geht.

# error.skippedLevel.inline
source: Skipped H%1$d
de: H%1$d übersprungen
