Repository: crinis/mindfula11y
Catalog: Resources/Private/Language/*.Database.xlf
Languages: de

# ttContent.columns.mindfula11y.headingType
source: Heading Type
de: Überschriftentyp

# ttContent.columns.mindfula11y.headingType.description
source: A heading type defines the structure of the document. It is especially important for users of assistive technology to efficiently navigate through the content.
de: Ein Überschriftentyp definiert die Struktur des Dokuments. Er ist besonders wichtig für Nutzer assistiver Technologien, um effizient durch den Inhalt zu navigieren.

# ttContent.columns.mindfula11y.headingType.items.p
source: Paragraph (p)
de: Absatz (p)

# ttContent.columns.mindfula11y.headingType.items.div
source: Generic div
de: Allgemeines div

# ttContent.tabs.accessibility
source: Accessibility
de: Barrierefreiheit

# ttContent.columns.mindfula11y.landmark
source: Landmark Type
de: Landmark-Typ

# ttContent.columns.mindfula11y.landmark.description
source: Choose how this content should be identified to screen reader users for easier page navigation. Only select a landmark type if this content represents a distinct, meaningful section of the page.
de: Wählen Sie, wie dieser Inhalt für Screenreader-Nutzer zur einfacheren Seitennavigation identifiziert werden soll. Wählen Sie nur dann einen Landmark-Typ, wenn dieser Inhalt einen eigenständigen, bedeutsamen Seitenbereich darstellt.

# ttContent.columns.mindfula11y.landmark.items.none
source: None
de: Keine

# ttContent.columns.mindfula11y.landmark.items.region
source: Important Section (only if none of the other options apply)
de: Wichtiger Bereich (nur wenn keine der anderen Optionen zutrifft)

# ttContent.columns.mindfula11y.landmark.items.navigation
source: Navigation Menu
de: Navigationsmenü

# ttContent.columns.mindfula11y.landmark.items.complementary
source: Sidebar / Related Content
de: Seitenleiste / Verwandte Inhalte

# ttContent.columns.mindfula11y.landmark.items.main
source: Main Content Area
de: Hauptinhaltsbereich

# ttContent.columns.mindfula11y.landmark.items.banner
source: Site Header
de: Seitenkopf

# ttContent.columns.mindfula11y.landmark.items.contentinfo
source: Site Footer
de: Seitenfuß

# ttContent.columns.mindfula11y.landmark.items.search
source: Search Function
de: Suchfunktion

# ttContent.columns.mindfula11y.landmark.items.form
source: Form Section
de: Formularabschnitt

# ttContent.columns.mindfula11y.ariaLabelledby
source: Use header as landmark name
de: Überschrift als Landmark-Name verwenden

# ttContent.columns.mindfula11y.ariaLabelledby.description
source: When enabled, the content element's header will be used as the accessible name for this landmark. IMPORTANT: Make sure your content element has a meaningful header when this option is enabled, as screen readers will announce it as the landmark's name.
de: Wenn aktiviert, wird die Überschrift des Inhaltselements als zugänglicher Name für dieses Landmark verwendet. WICHTIG: Stellen Sie sicher, dass Ihr Inhaltselement eine aussagekräftige Überschrift hat, wenn diese Option aktiviert ist, da Screenreader sie als Namen des Landmarks vorlesen werden.

# ttContent.columns.mindfula11y.ariaLabel
source: Custom landmark name
de: Benutzerdefinierter Landmark-Name

# ttContent.columns.mindfula11y.ariaLabel.description
source: Provide a descriptive name for this landmark that will be announced by screen readers. This should be concise but meaningful, helping users understand the purpose of this section.
de: Geben Sie einen beschreibenden Namen für dieses Landmark an, der von Screenreadern vorgelesen wird. Dieser sollte prägnant aber aussagekräftig sein und Nutzern helfen, den Zweck dieses Bereichs zu verstehen.
